package Tasks.LessonTwo;

public class TaskOne {
//    Создать программу, проверяющую и сообщающую на экран, является ли целое число записанное в переменную n, чётным либо нечётным.
    public static void eventOdd(int a){
        if (a % 2 == 0){
            System.out.println("Вы ввели четное число.");
        } else System.out.println("Вы ввели нечетное число.");
    }

}
